{
  "motivation": {
    "primary_questions": [
      "1. “Tell me about your current motivation to find work. What is driving you at this stage of your life?”",
      "2. “When you think about working, what feels most exciting or meaningful to you?”",
      "3. “What actions have you taken in the last two weeks related to finding a job or improving your skills?”",
      "4. “What challenges or concerns sometimes make it difficult for you to stay motivated?”",
      "5. “How do you keep yourself moving forward when things feel slow or difficult?”"
    ],
    "follow_up_probes": [
      "“Can you tell me more about that?”",
      "“What helped you stay focused in similar situations in the past?”"
    ],
    "scoring_guide": [
      {
        "score": 1,
        "description": "Very low motivation; no ownership; expresses no interest in finding work; fully reliant on external help.",
        "evidence": "“States they have no interest in working right now.” “Has taken no actions despite repeated support.” “Says family will solve it.”",
        "red_flags": "Refusal to engage; openly dismissive; blames others entirely; displays hopelessness or resistance."
      },
      {
        "score": 2,
        "description": "Very limited motivation; engages only when prompted; avoids responsibility; no independent action.",
        "evidence": "“Only considers options when I prompt them.” “Did not attempt any tasks suggested last session.”",
        "red_flags": "Avoids accountability; excuses for lack of action; unwillingness to take first steps."
      },
      {
        "score": 3,
        "description": "Some motivation but inconsistent; expresses desire but limited follow-through; needs repeated reminders.",
        "evidence": "“Expressed interest in job search but has not followed through.” “Started a CV but didn’t finish.”",
        "red_flags": "Inconsistent behaviours; low follow-through; poor time management."
      },
      {
        "score": 4,
        "description": "Developing motivation; emerging responsibility; has taken 1–2 small actions; requires structure & guidance.",
        "evidence": "“Completed registration on job portal.” “Started updating CV after reminder.”",
        "red_flags": "Easily discouraged; dependent on structure and reminders; slow momentum."
      },
      {
        "score": 5,
        "description": "Good motivation; engaged in some job search activities; open to feedback; shows willingness to improve.",
        "evidence": "“Applied to 2 roles this week.” “Open to feedback on CV.” “Attended training session.”",
        "red_flags": "May still struggle with confidence; occasional inconsistency."
      },
      {
        "score": 6,
        "description": "Strong motivation; consistent actions and follow-through; takes initiative; demonstrates discipline.",
        "evidence": "“Creates weekly job search plan.” “Follows deadlines without reminders.” “Responds quickly to messages.”",
        "red_flags": "May take on too much or overcommit; risk of burnout from high activity."
      },
      {
        "score": 7,
        "description": "Very high motivation; highly proactive; strong internal drive; accountable and self-managing.",
        "evidence": "“Initiates tasks independently.” “Researches employers proactively.” “Communicates updates without being asked.”",
        "red_flags": "Very few red flags; ensure expectations remain realistic."
      }
    ]
  },
  "career": {
    "primary_questions": [
      "1. “Which sectors or roles interest you the most right now, and why?”",
      "2. “What do you know about the requirements or skills needed for these roles in the UAE market?”",
      "3. “Have you spoken to anyone or researched the companies in Dubai or wider UAE where you might want to work?”",
      "4. “What salary range do you see as acceptable for an entry-level position in your chosen field?”",
      "5. “What does a successful career path look like for you over the next 1–2 years?”"
    ],
    "follow_up_probes": [
      "“What have you learned from your research?”",
      "“How did you decide that these roles are a good fit?”"
    ],
    "scoring_guide": [
      {
        "score": 1,
        "description": "No career direction; unclear interests; unrealistic expectations about roles or salaries; confused goals.",
        "evidence": "“Candidate unable to name any roles or sectors.” “States desire for senior role without qualifications.” “No understanding of salary ranges.”",
        "red_flags": "Unrealistic demands; confused/contradictory goals; expects high salary without experience; unwillingness to explore entry-level options."
      },
      {
        "score": 2,
        "description": "Minimal awareness; generic interests; limited understanding of job requirements; unrealistic views remain.",
        "evidence": "“Shows interest in general areas (e.g., ‘office job’) but no clarity.” “Cannot explain job requirements.”",
        "red_flags": "Generic answers; relies on stereotypes of roles; expects unrealistic working hours/conditions; little/no research."
      },
      {
        "score": 3,
        "description": "Emerging awareness; basic idea but unclear pathways; little or no research; uncertainty in choices.",
        "evidence": "“Interested in customer service roles but unsure about skills needed.” “Has looked briefly but no concrete research.”",
        "red_flags": "Limited understanding of sector norms; doubts about suitability; misalignment between interests and required skills."
      },
      {
        "score": 4,
        "description": "Partial clarity; has direction but needs validation; understands some requirements; refining options.",
        "evidence": "“Identified retail/admin roles as suitable.” “Understands need for communication skills.” “Knows entry-level requirements.”",
        "red_flags": "Needs help validating pathways; confusion between similar roles; unclear long-term direction."
      },
      {
        "score": 5,
        "description": "Clear career direction; understands entry-level expectations; realistic goals and pathways.",
        "evidence": "“Has researched entry-level customer service/admin roles.” “Understands expected salary range and working hours.” “Knows required qualifications.”",
        "red_flags": "Minor uncertainty about progression; limited understanding of employer expectations."
      },
      {
        "score": 6,
        "description": "Strong awareness; researched roles/companies; understands required skills, qualifications, and expectations.",
        "evidence": "“Identified 2–3 target sectors.” “Can list skills required.” “Has researched companies in UAE.”",
        "red_flags": "Needs to maintain realistic expectations; may be overly selective about roles."
      },
      {
        "score": 7,
        "description": "Fully aligned career plan; detailed understanding of sector; realistic expectations about growth, salary, and pathway.",
        "evidence": "“Clear 1–2 year plan.” “Understands growth opportunities.” “Has researched multiple companies and market trends.”",
        "red_flags": "Very few red flags; ensure plan is achievable within current skillset."
      }
    ]
  },
  "search": {
    "primary_questions": [
      "1. “How do you usually search for job vacancies? Which platforms or channels do you use?”",
      "2. “Do you have a CV or profile that is updated and suitable for the type of job you want?”",
      "3. “Have you applied for any roles recently? How did you prepare for the application or interview?”",
      "4. “What support do you feel you need to improve your applications or interviews?”",
      "5. “How confident do you feel when speaking to an employer or recruiter?”"
    ],
    "follow_up_probes": [
      "“Tell me about the last interview you attended.”",
      "“How did you prepare for it?”"
    ],
    "scoring_guide": [
      {
        "score": 1,
        "description": "No readiness; no CV; no independent applications; unaware of job search processes.",
        "evidence": "“No CV available.” “Has never visited any job portal.” “Does not know how to apply for a job.”",
        "red_flags": "Zero job search activity; confusion about process; complete dependency; lack of digital/literacy skills."
      },
      {
        "score": 2,
        "description": "Very low readiness; CV outdated/irrelevant; limited awareness of portals; poor interview understanding.",
        "evidence": "“CV last updated more than 1 year ago.” “Knows about portals but never used them.” “Cannot explain basic interview questions.”",
        "red_flags": "CV inaccuracies; outdated information; fear/avoidance of applications; very limited digital confidence."
      },
      {
        "score": 3,
        "description": "Basic readiness; some CV effort; limited application activity; lacks structured search strategy.",
        "evidence": "“CV drafted but incomplete.” “Has applied to 1–2 jobs in last month.” “Understands basic interview questions but lacks depth.”",
        "red_flags": "Sporadic actions; lacks structure; applies blindly; low application activity."
      },
      {
        "score": 4,
        "description": "Developing readiness; CV acceptable but needs polishing; sporadic search; basic interview preparation.",
        "evidence": "“CV format is clean but needs tailoring.” “Uses portals occasionally.” “Has practiced basic interview responses.”",
        "red_flags": "CV not tailored; relies on one portal; long gaps in applying; nervousness in interviews."
      },
      {
        "score": 5,
        "description": "Good readiness; updated CV; applies regularly; understands application and interview basics.",
        "evidence": "“Updated CV.” “Applies weekly.” “Can articulate strengths and experience.”",
        "red_flags": "Sometimes generic applications; limited follow-up."
      },
      {
        "score": 6,
        "description": "Strong readiness; confident using job portals; tailors applications; communicates effectively in interviews.",
        "evidence": "“Tailors CV to role.” “Uses multiple portals.” “Confident and structured interview responses.”",
        "red_flags": "May be overly selective; expects rapid results; slight overconfidence."
      },
      {
        "score": 7,
        "description": "Very high readiness; independent search and application management; strong CV; interview-ready.",
        "evidence": "“Has improved CV formats.” “Tracks applications independently.” “Confident handling both competency and behavioural interviews.”",
        "red_flags": "Very few; ensure expectations are realistic and sustained."
      }
    ]
  },
  "employability": {
    "primary_questions": [
      "1. “Tell me about a situation where you worked with others to complete a task. What role did you play?”",
      "2. “How do you manage your time and commitments when you have important tasks or deadlines?”",
      "3. “How comfortable are you communicating with different types of people—for example, managers, colleagues, or customers?”",
      "4. “What strengths do you feel you bring to a workplace?”",
      "5. “What areas do you think you need to develop to succeed at work?”"
    ],
    "follow_up_probes": [
      "“How did you handle disagreements?”"
    ],
    "scoring_guide": [
      {
        "score": 1,
        "description": "Very low employability; major behavioural or communication issues; poor reliability and professionalism.",
        "evidence": "“Arrived late with no explanation.” “Avoids eye contact and gives short answers.” “Shows no understanding of workplace behaviour.”",
        "red_flags": "Aggressive tone; inappropriate language; visible disinterest; major attendance/punctuality issues."
      },
      {
        "score": 2,
        "description": "Limited employability; struggles with teamwork; inconsistent communication; difficulty following instructions.",
        "evidence": "“Needed repeated instructions.” “Appears uncomfortable working with others.” “Gives unclear or short responses.”",
        "red_flags": "Difficulty understanding basic tasks; resistant to teamwork; communication barriers (language, confidence)."
      },
      {
        "score": 3,
        "description": "Emerging employability; basic communication; some teamwork ability; reliability gaps.",
        "evidence": "“Communicates at basic level.” “Participates when prompted.” “Missed one scheduled commitment.”",
        "red_flags": "Reliability concerns; low initiative; easily disengaged."
      },
      {
        "score": 4,
        "description": "Developing skills; communicates clearly most of the time; capable of basic responsibilities.",
        "evidence": "“Responds clearly to questions.” “Completed tasks in previous jobs or programmes.” “Shows willingness to learn.”",
        "red_flags": "Some nervousness; occasional misunderstandings; requires structure."
      },
      {
        "score": 5,
        "description": "Good employability; reliable, punctual, professional; good communication and teamwork.",
        "evidence": "“Consistently punctual.” “Communicates clearly.” “Demonstrates positive attitude.”",
        "red_flags": "Minor gaps in confidence; occasional hesitation with tasks."
      },
      {
        "score": 6,
        "description": "Strong workplace skills; communicates well; adapts to expectations; reliable under pressure.",
        "evidence": "“Handles questions confidently.” “Has worked in high-pressure roles.” “Adapts quickly to instructions.”",
        "red_flags": "Overconfidence; may take on too much; selective about teams or colleagues."
      },
      {
        "score": 7,
        "description": "Highly employable; polished professional behaviour; dependable; demonstrates leadership potential.",
        "evidence": "“Shows initiative.” “Structured and confident communication.” “Described leading or coordinating tasks in past roles.”",
        "red_flags": "Few red flags; monitor for unrealistic expectations about role level or speed of promotion."
      }
    ]
  },
  "learning": {
    "primary_questions": [
      "1. “In the past year, have you completed any training or learning—online or in person?”",
      "2. “What type of skills or courses do you feel would help you move towards your career goals?”",
      "3. “How do you typically approach learning new things—do you set aside time or follow a schedule?”",
      "4. “Are you open to joining training or workshops if they support your goals?”",
      "5. “What has helped you learn best in the past—videos, practice, coaching, classroom, online?”"
    ],
    "follow_up_probes": [
      "“What stopped you from completing past training?”"
    ],
    "scoring_guide": [
      {
        "score": 1,
        "description": "No engagement; resists learning; unwilling to participate in training or development activities.",
        "evidence": "“States they do not see value in training.” “Refused previous workshops.” “Shows no interest in skill improvement.”",
        "red_flags": "Open resistance; negative comments about learning; unwillingness to attend any training; mindset barrier."
      },
      {
        "score": 2,
        "description": "Very low engagement; attends only when required; minimal effort; lacks commitment to development.",
        "evidence": "“Attended mandatory sessions only.” “No follow-up on assigned learning tasks.”",
        "red_flags": "Passive participation; excuses to avoid sessions; lack of basic digital/literacy confidence."
      },
      {
        "score": 3,
        "description": "Emerging engagement; sees partial value; sporadic attendance; limited follow-through.",
        "evidence": "“Joined one session voluntarily.” “Expressed interest but did not complete exercises.”",
        "red_flags": "Inconsistency; dependence on reminders; motivation fluctuates."
      },
      {
        "score": 4,
        "description": "Developing engagement; willing to participate; completes basic learning tasks with guidance.",
        "evidence": "“Completed online course when prompted.” “Open to discussing learning needs.” “Actively listens in sessions.”",
        "red_flags": "Needs structure; may forget tasks; limited initiative in self-led learning."
      },
      {
        "score": 5,
        "description": "Good engagement; actively participates; applies learning; open to feedback and improvement.",
        "evidence": "“Completed two courses.” “Asked for feedback on progress.” “Takes notes during sessions.”",
        "red_flags": "Minor confidence dips; can be easily discouraged if progress is slow."
      },
      {
        "score": 6,
        "description": "Strong engagement; independently seeks learning; consistent growth mindset; takes responsibility.",
        "evidence": "“Registered spontaneously for training.” “Seeks additional resources.” “Practices skills between sessions.”",
        "red_flags": "Potential to overcommit; needs prioritisation support."
      },
      {
        "score": 7,
        "description": "Highly engaged learner; proactive, reflective; self-directed development; quickly applies learning.",
        "evidence": "“Maintains personal development plan.” “Shares reflections from learning.” “Actively improves skills.”",
        "red_flags": "Few red flags; ensure expectations are realistic and sustainable."
      }
    ]
  },
  "financial": {
    "primary_questions": [
      "1. “How do you currently manage your monthly expenses and responsibilities?”",
      "2. “What financial commitments do you need to consider when taking a job (transport, childcare, family support)?”",
      "3. “Have you used or applied for any support programmes, such as Nafis or CDA allowances?”",
      "4. “How confident are you in managing a salary once you start working?”",
      "5. “What would change financially for you if you started working full-time?”"
    ],
    "follow_up_probes": [
      "“What’s the biggest financial challenge you face right now?”"
    ],
    "scoring_guide": [
      {
        "score": 1,
        "description": "No financial independence; fully dependent on family; no awareness of basic costs or responsibilities.",
        "evidence": "“Does not know approximate living costs.” “Family pays all expenses.” “No personal budget or financial tasks.”",
        "red_flags": "Significant dependency; unrealistic salary expectations; no concept of budgeting; unwilling to contribute to household."
      },
      {
        "score": 2,
        "description": "Very limited independence; aware of some costs but not responsible; poor understanding of salary vs. expenses.",
        "evidence": "“Aware of bills but not involved.” “Thinks entry-level salary should cover luxury expenses.”",
        "red_flags": "Unrealistic expectations; financial irresponsibility; poor prioritisation."
      },
      {
        "score": 3,
        "description": "Basic awareness; understands essential expenses; limited experience managing money; inconsistent habits.",
        "evidence": "“Understands rent/transport costs.” “Occasionally contributes to household.”",
        "red_flags": "Poor financial planning; impulse spending; inconsistency."
      },
      {
        "score": 4,
        "description": "Developing responsibility; manages small expenses; basic budgeting; aware of realistic salary ranges.",
        "evidence": "“Pays for personal items.” “Tracks basic expenses.” “Understands entry-level salary ranges.”",
        "red_flags": "Over-reliance on family decisions; mild salary misinformation."
      },
      {
        "score": 5,
        "description": "Good financial responsibility; manages personal budget; understands trade-offs; realistic financial expectations.",
        "evidence": "“Has personal budget.” “Understands difference between gross and net income.” “Prioritises essentials.”",
        "red_flags": "Minor over-optimism; some pressure from family obligations."
      },
      {
        "score": 6,
        "description": "Strong financial independence; actively manages spending; plans for future; understands employment impact on finances.",
        "evidence": "“Saves money monthly.” “Understands benefit of stable employment.” “Manages own commitments.”",
        "red_flags": "None major; possible stress from financial obligations."
      },
      {
        "score": 7,
        "description": "Highly financially responsible; disciplined budgeting; financially independent; understands long-term implications.",
        "evidence": "“Manages all personal expenses independently.” “Has savings goals.” “Understands long-term financial planning.”",
        "red_flags": "Few red flags; ensure goals are realistic."
      }
    ]
  },
  "resilience": {
    "primary_questions": [
      "1. “How do you usually handle stress or challenges when things don’t go as planned?”",
      "2. “Tell me about a time you overcame a challenge recently.”",
      "3. “How confident do you feel when speaking in a professional setting?”",
      "4. “What helps you stay calm or focused during pressure?”",
      "5. “How comfortable are you adapting to change or new situations?”"
    ],
    "follow_up_probes": [
      "“What support helps you bounce back?”"
    ],
    "scoring_guide": [
      {
        "score": 1,
        "description": "Very low confidence; highly anxious or withdrawn; struggles to cope with stress; poor self-management.",
        "evidence": "“Avoids eye contact.” “Low voice, minimal responses.” “Unable to describe personal strengths.” “Reports giving up easily.”",
        "red_flags": "High anxiety, emotional instability, signs of distress; avoidance behaviour; may require additional support beyond employment coaching."
      },
      {
        "score": 2,
        "description": "Limited confidence; easily discouraged; difficulty managing emotions; inconsistent behaviour.",
        "evidence": "“Expresses fear of interviews.” “Overwhelmed by small challenges.” “Needs reassurance frequently.”",
        "red_flags": "Low tolerance for feedback; frequent emotional dips; reliance on others to cope."
      },
      {
        "score": 3,
        "description": "Basic confidence; able to communicate but hesitant; limited resilience; struggles under pressure.",
        "evidence": "“Answers questions with hesitation.” “Describes giving up when faced with challenges.” “Gets upset when corrected.”",
        "red_flags": "Unstable motivation; self-criticism; difficulty sustaining effort."
      },
      {
        "score": 4,
        "description": "Developing confidence; willing to try; recovers slowly from setbacks; requires structure.",
        "evidence": "“Open to trying new tasks.” “Reflects on past difficulties.” “Needs support to stay on track.”",
        "red_flags": "May take setbacks personally; inconsistent follow-through."
      },
      {
        "score": 5,
        "description": "Good confidence; manages stress reasonably; recovers from setbacks; self-aware and responsive to feedback.",
        "evidence": "“Communicates clearly.” “Shows examples of overcoming challenges.” “Accepts feedback respectfully.”",
        "red_flags": "Occasional dips under pressure; still developing deeper resilience."
      },
      {
        "score": 6,
        "description": "Strong confidence; self-managing; handles challenges constructively; good emotional control.",
        "evidence": "“Provides examples of solving problems independently.” “Balances commitments.” “Demonstrates consistency.”",
        "red_flags": "May push themselves too hard; risk of burnout; perfectionist tendencies."
      },
      {
        "score": 7,
        "description": "High resilience; confident communicator; strong coping skills; consistent self-management and emotional maturity.",
        "evidence": "“Articulates strengths clearly.” “Has strategies for dealing with setbacks.” “Maintains composure and focus.”",
        "red_flags": "Few red flags; ensure confidence is grounded in realistic expectations."
      }
    ]
  },
  "support": {
    "primary_questions": [],
    "follow_up_probes": [
      "“How do you usually get around Dubai?”",
      "“What would make it easier?”"
    ],
    "scoring_guide": [
      {
        "score": 1,
        "description": "No social support; environment creates strong barriers to employment; significant family or personal constraints.",
        "evidence": "“Family does not support working.” “Living situation prevents job search.” “Ongoing family conflict or obligations.”",
        "red_flags": "Family pressure against working; controlling environment; serious caregiving responsibilities; unsafe/stressful environment."
      },
      {
        "score": 2,
        "description": "Limited support; household responsibilities affect job readiness; low encouragement from family/friends.",
        "evidence": "“Family expects candidate to prioritise home duties.” “Limited support for childcare or transport.”",
        "red_flags": "Conflicting obligations; poor work-life balance; discouragement from job seeking."
      },
      {
        "score": 3,
        "description": "Basic support; family is neutral; some responsibilities may interfere; inconsistent encouragement.",
        "evidence": "“Family neither supportive nor obstructive.” “Occasional childcare/transport issues.”",
        "red_flags": "Unpredictable availability; lack of reliable support system."
      },
      {
        "score": 4,
        "description": "Developing support; environment mostly stable; occasional challenges but manageable with planning.",
        "evidence": "“Has someone who supports job search.” “Childcare/transport manageable with notice.”",
        "red_flags": "Occasional disruptions; needs structured planning."
      },
      {
        "score": 5,
        "description": "Good support; family encourages employment; reliable environment; manageable commitments.",
        "evidence": "“Family encourages job search.” “Has consistent transport/childcare support.”",
        "red_flags": "Minor coordination issues only."
      },
      {
        "score": 6,
        "description": "Strong support network; family/environment actively contributes to job readiness; stable home situation.",
        "evidence": "“Family providing help with transport.” “Encouraged to attend interviews/training.” “Safe and supportive environment.”",
        "red_flags": "Possible over-reliance on family; otherwise few red flags."
      },
      {
        "score": 7,
        "description": "Highly supportive environment; strong positive influence; resources and assistance available consistently.",
        "evidence": "“Family assists with logistics.” “Encourages career development.” “Stable environment with minimal barriers.”",
        "red_flags": "Few red flags; ensure independence develops appropriately."
      }
    ]
  }
}